src/main/java/com/lld/problems/commentsection/notes.md
```mermaid
classDiagram
    class User {
        -String userId
        -String userName
    }

    class Content {
        -String contentId
        -List~Comment~ comments
        +addComment(comment: Comment) void
        +getAllComments() List~Comment~
    }

    class Comment {
        -String commentId
        -String message
        -User author
        -List~Comment~ replies
        -Map~String, ReactionType~ reactions
        -boolean deleted
        +addReply(comment: Comment) void
        +editComment(newMessage) void
        +like(user: User) void
        +dislike(user: User) void
        +delete() void
    }

    class ReactionType {
        <<enumeration>>
        LIKE
        DISLIKE
    }

    Content *-- Comment
    Comment *-- Comment
    Comment --> User
```
